In [1]:
import pandas as pd

In [2]:
#make a reference to the purhcase data csv.
data_file = "Resources/purchase_data.csv"
#import purhcase data as a dataframe file
df = pd.read_csv(data_file)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#Total Players Answer
total_players =len(df["SN"].unique())
display(total_players)

576

In [5]:

#Calculate Number of Unique Items
len(df["Item Name"].unique())

179

In [4]:
#Calculate Average Purchasing Price
df["Price"].mean()

3.050987179487176

In [5]:
#Total Number of Purchases
len(df["Purchase ID"])

780

In [6]:
#Total Revenue
df["Price"].sum()

2379.77

In [65]:
#Gemder Demographics

#Count of Male Players
demo =df.groupby(['Gender'])['SN'].unique()

In [62]:
#count of Males
Male = len(demo['Male'])
Male

484

In [66]:
# Count of Females
Female = len(demo['Female'])
Female

81

In [9]:
#Percentage and Count of Male Players - Percentage
demo_pct = df["Gender"].value_counts(normalize = True)
demo

Male                     0.835897
Female                   0.144872
Other / Non-Disclosed    0.019231
Name: Gender, dtype: float64

In [279]:
#Top Spenders Answer
df.groupby(["SN"])["Price"].agg(['count', 'mean', 'sum']).sort_values("count", ascending=False).head()

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Iral74           4  3.405000  13.62
Idastidru52      4  3.862500  15.45
Asur53           3  2.480000   7.44
Inguron55        3  3.703333  11.11

In [247]:
#Age vs. Price Data
bins = pd.cut(df['Age'], [10, 15, 20, 25, 30, 35, 40, 50,60])
df.groupby(bins)['Price'].agg(['count', 'mean', 'sum'])

          count      mean     sum
Age
(10, 15]     54  2.900000  156.60
(15, 20]    200  3.107800  621.56
(20, 25]    325  3.020431  981.64
(25, 30]     77  2.875584  221.42
(30, 35]     52  2.994423  155.71
(35, 40]     33  3.404545  112.35
(40, 50]      7  3.075714   21.53
(50, 60]      0       NaN    0.00

In [298]:
#count of different ages
bins = pd.cut(df['Age'], [10, 15, 20, 25, 30, 35, 40, 50,60])
df.groupby(bins)['Price'].agg(['count', 'mean', 'sum'])

          count      mean     sum
Age
(10, 15]     54  2.900000  156.60
(15, 20]    200  3.107800  621.56
(20, 25]    325  3.020431  981.64
(25, 30]     77  2.875584  221.42
(30, 35]     52  2.994423  155.71
(35, 40]     33  3.404545  112.35
(40, 50]      7  3.075714   21.53
(50, 60]      0       NaN    0.00

In [299]:
#Most Popular Items Answer
pop_items =df.groupby(["Item ID", "Item Name"])["Price"].agg(['count', 'mean', 'sum']).sort_values("count", ascending=False).head()
display(pop_items)

                                                      count  mean    sum
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm     12  4.23  50.76
145     Fiery Glass Crusader                              9  4.58  41.22
108     Extraction, Quickblade Of Trembling Hands         9  3.53  31.77
82      Nirvana                                           9  4.90  44.10
19      Pursuit, Cudgel of Necromancy                     8  1.02   8.16

In [278]:
#Most Profitable Item Answer!!
df.groupby(["Item ID", "Item Name"])["Price"].agg(['count', 'mean', 'sum']).sort_values("sum", ascending=False).head()

                                                      count  mean    sum
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm     12  4.23  50.76
82      Nirvana                                           9  4.90  44.10
145     Fiery Glass Crusader                              9  4.58  41.22
92      Final Critic                                      8  4.88  39.04
103     Singed Scalpel                                    8  4.35  34.80

In [274]:
#Top Spenders Answer
df.groupby(["SN"])["Price"].agg(['count', 'mean', 'sum']).sort_values("sum", ascending=False).head()

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Chamjask73       3  4.610000  13.83
Iral74           4  3.405000  13.62
Iskadarya95      3  4.366667  13.10

In [289]:
#Gender Breakdown Amounts
df.groupby(["Gender"])["Price"].agg(['count', 'mean','sum'])

                       count      mean      sum
Gender
Female                   113  3.203009   361.94
Male                     652  3.017853  1967.64
Other / Non-Disclosed     15  3.346000    50.19